Terraform Plan:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.dev_assume_role will be created
  + resource "github_actions_secret" "dev_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-app-name-tf"
      + secret_name     = "DEV_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.gh_token_secret will be created
  + resource "github_actions_secret" "gh_token_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-app-name-tf"
      + secret_name     = "GH_PAT_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.prod_assume_role will be created
  + resource "github_actions_secret" "prod_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-app-name-tf"
      + secret_name     = "PROD_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.stage_assume_role will be created
  + resource "github_actions_secret" "stage_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-app-name-tf"
      + secret_name     = "STAGE_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.infra_template_barnch_protection will be created
  + resource "github_branch_protection" "infra_template_barnch_protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "aws-app-name-tf"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + pull_request_bypassers          = [
              + "/JosiahBurnham",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = true
          + required_approving_review_count = 1
        }
    }

  # github_repository.infra_template will be created
  + resource "github_repository" "infra_template" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Repo for App Name"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "aws-app-name-tf"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + template {
          + include_all_branches = false
          + owner                = "JosiahBurnham"
          + repository           = "aws-infra-template-tf"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/repos_aws-app-name-tf.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/repos_aws-app-name-tf.tfplan"
stdout<<ghadelimiter_6ae79f4a-c07f-40c9-a1dc-7f2a06430ef0

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.dev_assume_role will be created
  + resource "github_actions_secret" "dev_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-app-name-tf"
      + secret_name     = "DEV_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.gh_token_secret will be created
  + resource "github_actions_secret" "gh_token_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-app-name-tf"
      + secret_name     = "GH_PAT_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.prod_assume_role will be created
  + resource "github_actions_secret" "prod_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-app-name-tf"
      + secret_name     = "PROD_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.stage_assume_role will be created
  + resource "github_actions_secret" "stage_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-app-name-tf"
      + secret_name     = "STAGE_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.infra_template_barnch_protection will be created
  + resource "github_branch_protection" "infra_template_barnch_protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "aws-app-name-tf"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + pull_request_bypassers          = [
              + "/JosiahBurnham",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = true
          + required_approving_review_count = 1
        }
    }

  # github_repository.infra_template will be created
  + resource "github_repository" "infra_template" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Repo for App Name"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "aws-app-name-tf"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + template {
          + include_all_branches = false
          + owner                = "JosiahBurnham"
          + repository           = "aws-infra-template-tf"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/repos_aws-app-name-tf.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/repos_aws-app-name-tf.tfplan"

ghadelimiter_6ae79f4a-c07f-40c9-a1dc-7f2a06430ef0
stderr<<ghadelimiter_1cb90d1e-a8fb-4b6c-b9a1-aa88f6f135f8

ghadelimiter_1cb90d1e-a8fb-4b6c-b9a1-aa88f6f135f8
exitcode<<ghadelimiter_75f523e6-b267-4da5-b451-c3c80f7729e4
0
ghadelimiter_75f523e6-b267-4da5-b451-c3c80f7729e4
```